<template>
  <div class="">
    <p>
      computed va watch nima va ular orasidagi farqni tushuntiring. Misollar keltiring computed —
      это свойство в Vue.js, которое позволяет вычислять и кэшировать значения на основе реактивных
      данных. В отличие от обычных методов, computed автоматически обновляется, когда зависит от
      изменяющихся данных. Чаще всего, он вычисляет значение свойства, которое может зависеть от
      других свойств, Watch — это метод, который наблюдает за свойством данных с тем же именем
      Наблюдатель запускается каждый раз при изменении значения свойства данных. Отличие: Watch
      следит за свойствами когда он меняется , а comp вычисляет когда он зависит
    </p>

    <p>
      Transition komponentidan foydalanib, qanday qilib animatsiyalarni amalga oshirish mumkin?
      TRansition Его можно использовать для применения анимации входа и выхода к элементам или
      компонентам, переданным ему через слот по умолчанию. Его можно вызвать с помощью v-if, v-show
    </p>

    <p>
      Key va Ref atributlari nima? Qachon va nima uchun ularni ishlatish kerak? Key Атрибут
      используется для подсказки для vUE. Испозльзуется также для перехода анимации. Атрибут REF
      используется для регистрации ссылки на дочерний элемент. Он добавляет от родительского
      элемента
    </p>

    <p> Provide/Inject nima va ular qanday ishlaydi? Misol bilan tushuntiring.
      С их использованием можно передать напрямую.
      данные из родительского компонента в дочерний передаются с помощью входных параметров.То есть когда из глубоко вложенных с родительствого элемента нужно передать дочериний тогда можно использовать Provide/Inject
     
    </p>
  </div>
</template>

<script setup></script>
